artillery.yml
config:
  target: http://localhost:8080
  phases:
  - duration: 10
    arrivalRate: 2
    name: Warm-up
  - duration: 30
    arrivalRate: 5
    name: Normal load
  - duration: 20
    arrivalRate: 10
    name: Peak load
  processor: ./artillery-processor.js
  ensure:
    p95: 500
    p99: 1000
    maxErrorRate: 1
    minRPS: 8
scenarios:
- name: Health Check
  weight: 30
  flow:
  - get:
      url: /health
      capture:
      - json: $.status
        as: healthStatus
  - think: 1
- name: API Authentication Flow
  weight: 40
  flow:
  - post:
      url: /auth/login
      json:
        username: test_user
        password: test_password
      expect:
      - statusCode:
        - 200
        - 401
      capture:
      - json: $.access_token
        as: authToken
  - think: 2
- name: Host Management API
  weight: 20
  flow:
  - get:
      url: /api/hosts
      headers:
        Authorization: Bearer {{ authToken }}
      expect:
      - statusCode:
        - 200
        - 401
  - think: 1
- name: WebSocket Connection Test
  weight: 10
  flow:
  - get:
      url: /ws
      expect:
      - statusCode:
        - 101
        - 400
        - 426
  - think: 3